УТ_для_edt.РасширениеСмарт/src/Catalogs/Партнеры/Партнеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Партнеры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>НеизвестныйПартнер</name>
      <description>Неизвестный партнер</description>
    </items>
  </predefined>
  <attributes>
    <name>БизнесРегион</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Конкурент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПрочиеОтношения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбслуживаетсяТорговымиПредставителями</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Пол</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОсновнойМенеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ШаблонЭтикетки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВариантОтправкиЭлектронногоЧека</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтакнаяИнформацияПартнераАнгл</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартОсновнойМенеджерСервисЦентра</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартДилерСервисЦентра</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Дилер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Перепродавец</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерСпособДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерАдресДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерПеревозчикПартнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерАдресДоставкиПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерЗонаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерВремяДоставкиС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерВремяДоставкиПо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерДополнительнаяИнформацияПоДоставке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерОсобыеУсловияПеревозки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерОсобыеУсловияПеревозкиОписание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерКонтактноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерТелефонКонтактногоЛица</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерПропускнаяСистема</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерДополнительнаяОбработкаГрузаТранспортнойКомпанией</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерСпособДоставкиТовара</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерПлатильщикЗаДоставкуГруза</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="431ea12d-0bcd-44da-8c13-8fd3e3e1a591">
    <name>смартДилерБывший</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8d8288f2-9450-4c32-b3b2-af0cc494cf90">
    <name>смартКлючевойКлиентПоРасходнымМатериалам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Город</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Страна</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Регион</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартОборудованиеКлиентов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>смартНаименованиеОборудования</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>смартОборудованиеКлиента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>смартКомментарий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>смартДатаДобавления</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартЧернилаКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>смартЧернилаКлиента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>смартКомментарий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>смартДатаДобавления</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="a039b99d-5c3e-46bf-b321-17891d574d3e">
    <name>смартВидыДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="b5fe9406-a0b5-49eb-9e30-99dd19a7a18b">
      <name>ВидДеятельности</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="c9650fb8-3e0f-4ca1-b198-3b3d9b8f018c">
    <name>смартТипичноеОборудование</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="082a786c-a92a-457f-bce6-eb2074d564f5">
      <name>ТипичноеОборудование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/Enums/КомпанияЧастноеЛицо/КомпанияЧастноеЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>КомпанияЧастноеЛицо</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="640f3f70-7e8d-48fb-8487-fda65cb57f60">
    <name>ЧастноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="af9cb34d-d5ea-4de1-a7d6-999e6bd67541">
    <name>Компания</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Enums/ЮрФизЛицо/ЮрФизЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЮрФизЛицо</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ЮрЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ФизЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЮрЛицоНеРезидент</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ИндивидуальныйПредприниматель</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыКонтактнойИнформации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Адрес</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Телефон</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АдресЭлектроннойПочты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Skype</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВебСтраница</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Факс</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Другое</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Catalogs/Партнеры/Forms/CRM_Модуль_ФормаБыстрогоВвода/Module.bsl
//++#1012 смарт: Холопов 04.05.2022 // Проверка полей с контактной информацией 
&НаКлиенте
&После("EmailПриИзменении")
Процедура смарт_EmailПриИзменении(Элемент)
	смартОбщегоНазначенияКлиент.ПроверитьПочтуПриИзменении(Элемент,Объект.Ссылка,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
&После("EmailКонтактногоЛицаПриИзменении")
Процедура смарт_EmailКонтактногоЛицаПриИзменении(Элемент)
	смартОбщегоНазначенияКлиент.ПроверитьПочтуПриИзменении(Элемент,смартПолучитьПустуюСсылкуКЛ(),ЭтаФорма);
КонецПроцедуры

&НаСервере
Функция  смартПолучитьПустуюСсылкуКЛ()

	Возврат Справочники.КонтактныеЛицаПартнеров.ПустаяСсылка();	

КонецФункции 

&НаКлиенте
&После("ПриОткрытии")
Процедура смарт_ПриОткрытии(Отказ)
	
	КодСтраныКонтактногоЛица = "+7";
	КодСтраны = "+7";
	
	//Телефон партнёра подсказки
	Элементы.КодСтраны.Подсказка = "Код страны";
	Элементы.КодГорода.Подсказка = "Код города";
	Элементы.Телефон.Подсказка	 = "Телефон";
	
	//Телефон контакта подсказки
	Элементы.КодСтраныКонтактногоЛица.Подсказка = "Код страны";
	Элементы.КодГородаКонтактногоЛица.Подсказка = "Код города";
	Элементы.ТелефонКонтактногоЛица.Подсказка	= "Телефон";
	
КонецПроцедуры

&НаКлиенте
Процедура смартПриИзмененииТелефона(Элемент) // можно вводить только цифры
		
	Строка = СокрЛП(Элемент.ТекстРедактирования);
	
	ЭтотОбъект[Элемент.Имя] = смартНайтиЧислаВСтроке(Строка);  

	//++ #1152 смарт: Лопато 18.10.2024 //Партнеры. Не контролируется уникальность КИ при изменении.  
	ОкончаниеРеквизита = СтрЗаменить(Элемент.Имя, "Телефон", "");
	
	СтрокаТелефон = СокрЛП(ЭтотОбъект["КодСтраны" + ОкончаниеРеквизита])
				  + СокрЛП(ЭтотОбъект["КодГорода" + ОкончаниеРеквизита])
				  + СокрЛП(ЭтотОбъект["Телефон"   + ОкончаниеРеквизита]);
	
	СтруктураПроверки = Новый Структура;
	
	СтруктураПроверки.Вставить("Значение", 		"");
	СтруктураПроверки.Вставить("Представление", СтрокаТелефон);
	СтруктураПроверки.Вставить("Владелец", 		Неопределено);

	Если Элемент.Имя = "Телефон" Тогда
		СтруктураПроверки.Вставить("Ссылка", ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка"));
	Иначе	
		СтруктураПроверки.Вставить("Ссылка", ПредопределенноеЗначение("Справочник.КонтактныеЛицаПартнеров.ПустаяСсылка"));
	КонецЕсли;	
	
	ИтогПроверки = смартОбщегоНазначения.ПроверитьТелефон(СтруктураПроверки); 
	
	Если ИтогПроверки.КодОшибки <> 0 Тогда

		ОчиститьСообщения();

		Если ИтогПроверки.КодОшибки = 12 И ИтогПроверки.Свойство("МассивДублей") Тогда
			
			ОбщегоНазначенияКлиент.СообщитьПользователю(ИтогПроверки.СообщениеОшибки, , Элемент.Имя);
			
			Для Каждого ЭлементДубль Из ИтогПроверки.МассивДублей Цикл
				ОбщегоНазначенияКлиент.СообщитьПользователю(ЭлементДубль.ТекстСообщения, ЭлементДубль.Ключ);
			КонецЦикла;
			
		Иначе	

			ОбщегоНазначенияКлиент.СообщитьПользователю(ИтогПроверки.СообщениеОшибки, , Элемент.Имя);
			
		КонецЕсли;

		ЭтотОбъект["КодСтраны" + ОкончаниеРеквизита] = "";
		ЭтотОбъект["КодГорода" + ОкончаниеРеквизита] = "";
		ЭтотОбъект["Телефон"   + ОкончаниеРеквизита] = "";
		
	КонецЕсли;
	//-- #1152 смарт: Лопато 18.10.2024
	
КонецПроцедуры

&НаСервере
Функция смартНайтиЧислаВСтроке(Строка) 
	
	СтрокаЧисел = "";
	
	Для Индекс = 1 По СтрДлина(Строка) Цикл
		
		Символ = Сред(Строка, Индекс, 1); // Перебираем все символы из нашей строки
		
		Если КодСимвола(Символ) >= 48 И КодСимвола(Символ) <= 57 Тогда // Код нуля - 48, код 9-ки - 57
			СтрокаЧисел = СтрокаЧисел + Символ;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтрокаЧисел
	
КонецФункции

&НаКлиенте
Процедура смарт_ТелефонПриИзмененииПосле(Элемент)
	смартПриИзмененииТелефона(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура смарт_ТелефонКонтактногоЛицаПриИзмененииПосле(Элемент)
	смартПриИзмененииТелефона(Элемент);
КонецПроцедуры
//--#1012 смарт: Холопов 04.05.2022

//++ #1537 смарт: Мосолов 11.01.2024 //Запрет создания элементов справочника Бизнес-регионы 
// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
	
КонецПроцедуры //-- #1537 смарт: Мосолов 11.01.2024

//++ #1537 смарт: Мосолов 11.01.2024 //Запрет создания элементов справочника Бизнес-регионы 
// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры //-- #1537 смарт: Мосолов 09.01.2024

//++ #1537 смарт: Мосолов 09.01.2024 //Запрет создания элементов справочника Бизнес-регионы 
&НаКлиенте
Процедура смартБизнесРегионАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь; 
		
	Если СтрДлина(СокрЛП(Текст)) >= 3 Тогда
		
		ДанныеВыбора = смартПолучитьДанныеВыбораБизнесРегиона(Текст); 
		
	КонецЕсли;
	
КонецПроцедуры //-- #1537 смарт: Мосолов 09.01.2024

//++ #1537 смарт: Мосолов 11.01.2024 //Запрет создания элементов справочника Бизнес-регионы 
&НаСервереБезКонтекста
Функция смартПолучитьДанныеВыбораБизнесРегиона(Текст) 
	
	Возврат Справочники.БизнесРегионы.смартПолучитьДанныеВыбораБизнесРегиона(Текст);

КонецФункции //-- #1537 смарт: Мосолов 11.01.2024

//++ #1537 смарт: Мосолов 09.01.2024 //Запрет создания элементов справочника Бизнес-регионы 
&НаКлиенте
Процедура смартБизнесРегионОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка) 
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда 
		
		ВыбранноеЗначение = смартСоздатьБизнесРегион(ВыбранноеЗначение);  
		
	Иначе
		
		СтруктураВозврата = смартПолучитьУровеньКодСубьектаСправочника(ВыбранноеЗначение); 
		
		Если СтруктураВозврата.Уровень = 0 ИЛИ (СтруктураВозврата.Уровень = 1 И СтруктураВозврата.КодСубъекта <> 0) Тогда
			
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Для субъектов РФ необходимо выбрать населенный пункт'"));
			
			ВыбранноеЗначение = ПредопределенноеЗначение("Справочник.БизнесРегионы.ПустаяСсылка");  
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры //-- #1537 смарт: Мосолов 09.01.2024

//++ #1537 смарт: Мосолов 11.01.2024 //Запрет создания элементов справочника Бизнес-регионы 
&НаСервереБезКонтекста
Функция смартСоздатьБизнесРегион(ВыбранноеЗначение) 
	
	Возврат Справочники.БизнесРегионы.смартСоздатьБизнесРегион(ВыбранноеЗначение);

КонецФункции //-- #1537 смарт: Мосолов 11.01.2024

//++ #1537 смарт: Мосолов 11.01.2024 //Запрет создания элементов справочника Бизнес-регионы 
&НаСервереБезКонтекста
Функция смартПолучитьУровеньКодСубьектаСправочника(ЭлементСправочника) 
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Уровень", ЭлементСправочника.Уровень());
	СтруктураВозврата.Вставить("КодСубъекта", ЭлементСправочника.СмартКодСубъектаРФ);
	
	Возврат СтруктураВозврата;

КонецФункции //-- #1537 смарт: Мосолов 11.01.2024


//++ #1615 смарт: Мосолов 29.01.2024 //Заполнение и передача на сайт менеджеров по расходым материалам
&НаКлиенте
&ИзменениеИКонтроль("ПроверкаЗаполнения")
Функция смарт_ПроверкаЗаполнения()

	ОшибокНет = Истина;

	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнено наименование'"), , "Наименование");
		ОшибокНет = Ложь;
	КонецЕсли;

	Если НЕ ((ЗначениеЗаполнено(ВидТелефонаКлиента) И ЗначениеЗаполнено(Телефон))
		ИЛИ (ЗначениеЗаполнено(ВидEmailКлиента) И ЗначениеЗаполнено(Email))
		ИЛИ (ЗначениеЗаполнено(ВидАдреса) И ЗначениеЗаполнено(Адрес))
		ИЛИ (ЗначениеЗаполнено(ВидТелефонаКонтактногоЛица) И ЗначениеЗаполнено(ТелефонКонтактногоЛица))
		ИЛИ (ЗначениеЗаполнено(ВидEmailКонтактногоЛица) И ЗначениеЗаполнено(EmailКонтактногоЛица))) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнена контактная информация!'"),, "Телефон");

		ОшибокНет = Ложь;

	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ФамилияКонтактногоЛица)
		И НЕ ЗначениеЗаполнено(ИмяКонтактногоЛица) 
		И НЕ ЗначениеЗаполнено(ОтчествоКонтактногоЛица)
		И (ЗначениеЗаполнено(ТелефонКонтактногоЛица) ИЛИ ЗначениеЗаполнено(EmailКонтактногоЛица)) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнена ФИО контактного лица!'"),, "ФамилияКонтактногоЛица");

		ОшибокНет = Ложь;

	КонецЕсли;

	ВыбранТипОтношений = Ложь;

	Для каждого ТипыОтношенийЭлементСписка Из CRM_ВсеТипыОтношений Цикл

		Если ТипыОтношенийЭлементСписка.Пометка Тогда

			ВыбранТипОтношений = Истина;

			Прервать;

		КонецЕсли; 

	КонецЦикла;	

	Если Не ВыбранТипОтношений Тогда
		//
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Необходимо определить хотя бы один тип бизнес-отношений!'"),, "CRM_ТипыОтношений");
		ОшибокНет = Ложь;
	КонецЕсли;

	Если ИспользуютсяГруппыДоступаПартнеров И ГруппаДоступа = ПредопределенноеЗначение("Справочник.ГруппыДоступаПартнеров.ПустаяСсылка") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Необходимо указать группу доступа партнера'"),, "ГруппаДоступа");
		ОшибокНет = Ложь;
	КонецЕсли;

	Если ЭтоКомпания = 0 Тогда

		Если ПустаяСтрока(ИНН) И Не ПустаяСтрока(КПП) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Указан КПП, но не указан ИНН'"), , "ИНН");
			ОшибокНет = Ложь;
		КонецЕсли;

	КонецЕсли;

	Если ОшибокНет Тогда

		// Проверка ИНН
		Если ЭтоКомпания = 0 И НЕ ПустаяСтрока(ИНН) Тогда
			ТекстСообщения = "";
			Если НЕ РегламентированныеДанныеКлиентСервер.ИННСоответствуетТребованиям(ИНН, ?(ВидКомпании = 2, Ложь, Истина), ТекстСообщения) Тогда
				ОшибокНет  = Ложь;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "ИНН");
			КонецЕсли;
		ИначеЕсли ЭтоКомпания = 1 И (НЕ ПустаяСтрока(ИННПартнерФизЛицо)) Тогда
			ТекстСообщения = "";
			Если НЕ РегламентированныеДанныеКлиентСервер.ИННСоответствуетТребованиям(ИННПартнерФизЛицо, Ложь, ТекстСообщения) Тогда
				ОшибокНет  = Ложь;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "ИННПартнерФизЛицо");
			КонецЕсли;
		КонецЕсли;

		// Проверка КПП
		Если ЭтоКомпания = 0 И НЕ ПустаяСтрока(КПП) Тогда
			ТекстСообщения = "";
			Если НЕ РегламентированныеДанныеКлиентСервер.КППСоответствуетТребованиям(КПП, ТекстСообщения) Тогда
				ОшибокНет  = Ложь;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "КПП");
			КонецЕсли;
		КонецЕсли;

		// ПроверкаОКПО
		Если ЭтоКомпания = 0 И Не ПустаяСтрока(КодПоОКПО) Тогда
			ТекстСообщения = "";
			Если НЕ РегламентированныеДанныеКлиентСервер.КодПоОКПОСоответствуетТребованиям(КодПоОКПО, Истина,ТекстСообщения) Тогда
				ОшибокНет  = Ложь;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "КодПоОКПО");
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;	

	#Вставка 
	//++ #1615 смарт: Мосолов 29.01.2024 //Заполнение и передача на сайт менеджеров по расходным материалам
	
	Если Не ЗначениеЗаполнено(ОсновнойМенеджер) Тогда
		
		ОшибокНет  = Ложь;
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо указать основного менеджера партнера'"), , "ОсновнойМенеджер");
		
	КонецЕсли;
	
	//++#1615 смарт: Лопато 08.02.2024 //Заполнение и передача на сайт менеджеров по расходым материалам  
	//Если Не ЗначениеЗаполнено(ЭтаФорма.смартМенеджерПоРасходнымМатериалам) Тогда
	//	
	//	ОшибокНет  = Ложь;
	//	ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо указать менеджера по расходным материалам'"), , "смартМенеджерПоРасходнымМатериалам");
	//	
	//КонецЕсли;
	//--#1615 смарт: Лопато 08.02.2024
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.БизнесРегион) Тогда
		
		ОшибокНет  = Ложь;
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо указать бизнес-регион'"), , "БизнесРегион");
		
	КонецЕсли;
	
	//-- #1615 смарт: Мосолов 29.01.2024 
	#КонецВставки 
	
	Возврат ОшибокНет;

КонецФункции //++ #1615 смарт: Мосолов 29.01.2024 //Заполнение и передача на сайт менеджеров по расходым материалам

//++ #1615 смарт: Мосолов 29.01.2024 //Заполнение и передача на сайт менеджеров по расходым материалам
&НаСервере
&ИзменениеИКонтроль("СоздатьНовогоКлиента")
Функция смарт_СоздатьНовогоКлиента()

	ТекстСообщения = "";

	НовыйПартнер = Справочники.Партнеры.СоздатьЭлемент();
	НовыйПартнер.Заполнить(Неопределено);

	НовыйПартнер.ЮрФизЛицо					= ВидПартнера;

	НовыйПартнер.Наименование				= Наименование;
	НовыйПартнер.НаименованиеПолное			= ?(ЗначениеЗаполнено(НаименованиеПолное),НаименованиеПолное,Наименование);
	Если (НовыйПартнер.ЮрФизЛицо = Перечисления.КомпанияЧастноеЛицо.ЧастноеЛицо) И НЕ ПустаяСтрока(НаименованиеПолное) Тогда
		СтрокаНаименования 					= СокрЛП(НаименованиеПолное); 
		ПозицияПробела 						= Найти(СтрокаНаименования, " ");
		Если ПозицияПробела > 0 Тогда
			НовыйПартнер.CRM_Фамилия		= Лев(СтрокаНаименования, ПозицияПробела - 1);
			СтрокаНаименования				= СокрЛП(Сред(СтрокаНаименования, ПозицияПробела));
			ПозицияПробела 					= Найти(СтрокаНаименования, " ");
			Если ПозицияПробела > 0 Тогда
				НовыйПартнер.CRM_Имя		= Лев(СтрокаНаименования, ПозицияПробела - 1);
				НовыйПартнер.CRM_Отчество	= СокрЛП(Сред(СтрокаНаименования, ПозицияПробела));
			Иначе
				НовыйПартнер.CRM_Имя		= СтрокаНаименования;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
	НовыйПартнер.БизнесРегион				= БизнесРегион;
	НовыйПартнер.Родитель					= ГоловноеПредприятие;

	НовыйПартнер.CRM_ОсновнаяОтрасль		= ОсновнаяОтрасль;
	НовыйПартнер.ОсновнойМенеджер			= ОсновнойМенеджер;
	
	#Вставка 
	//++ #1615 смарт: Мосолов 29.01.2024 //Заполнение и передача на сайт менеджеров по расходным материалам
	НовыйПартнер.смартМенеджерПоРасходнымМатериалам			= ЭтаФорма.смартМенеджерПоРасходнымМатериалам;
	НовыйПартнер.смартОсновнойМенеджерСервисЦентра			= ЭтаФорма.смартОсновнойМенеджерСервисЦентра;
	//-- #1615 смарт: Мосолов 29.01.2024 
	#КонецВставки
	
	НовыйПартнер.ГруппаДоступа				= ГруппаДоступа;
	НовыйПартнер.Комментарий				= Комментарий;
	НовыйПартнер.CRM_НапоминатьОДнеРождения	= Истина;
	НовыйПартнер.ДатаРегистрации			= CRM_ОбщегоНазначенияСервер.ПолучитьТекущуюДатуСеанса();
	НовыйПартнер.CRM_СтатусРаботы 			= Справочники.CRM_СтатусыРаботыСКлиентом.Работаем;

	Если ЗначениеЗаполнено(ВидТелефонаКлиента) И ЗначениеЗаполнено(Телефон) Тогда
		КодСтраныСтрока	= ?(ЗначениеЗаполнено(КодСтраны), СокрЛП(КодСтраны), "");
		Если НЕ ПустаяСтрока(КодСтраныСтрока) И (Найти(КодСтраныСтрока, "+") = 0) Тогда
			КодСтраныСтрока = "+" + КодСтраныСтрока;
		КонецЕсли;	
		СписокПолей	= Новый СписокЗначений;
		СписокПолей.Добавить(КодСтраныСтрока,   "КодСтраны");
		СписокПолей.Добавить(КодГорода,     	"КодГорода");
		СписокПолей.Добавить(Телефон, 			"НомерТелефона");
		СписокПолей.Добавить(ДобНомер,    		"Добавочный");
		СписокПолей.Добавить("",   				"Комментарий");

		CRM_УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(НовыйПартнер, CRM_ОбщегоНазначенияСервер.ЗначениеПолейВXML(СписокПолей, ВидТелефонаКлиента.Тип)
		, ВидТелефонаКлиента, ВидТелефонаКлиента.Тип,,, Истина);

	КонецЕсли;

	Если ЗначениеЗаполнено(ВидEmailКлиента) И ЗначениеЗаполнено(Email) Тогда
		НовыйКонтакт						= НовыйПартнер.КонтактнаяИнформация.Добавить();
		НовыйКонтакт.Вид					= ВидEmailКлиента;
		НовыйКонтакт.Тип					= ВидEmailКлиента.Тип;
		НовыйКонтакт.Представление			= СокрЛП(Email);
		НовыйКонтакт.CRM_ОсновнойДляСвязи	= Истина;				

		Попытка
			Результат = ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСПочтовымиАдресами(Email);
		Исключение
			СообщениеОбОшибке = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			Возврат Неопределено;
		КонецПопытки;

		Если Результат.Количество() > 0 Тогда
			НовыйКонтакт.АдресЭП = Результат[0].Адрес;

			Поз = Найти(НовыйКонтакт.АдресЭП, "@");
			Если Поз <> 0 Тогда
				НовыйКонтакт.ДоменноеИмяСервера = Сред(НовыйКонтакт.АдресЭП, Поз+1);
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;


	Если ЗначениеЗаполнено(ВидАдреса) И ЗначениеЗаполнено(Адрес) Тогда
		Для Каждого Стр Из КонтактнаяИнформацияОписаниеДополнительныхРеквизитов Цикл
			Если Стр.ИмяРеквизита = "Адрес" Тогда
				УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(НовыйПартнер, Стр.Значение, ВидАдреса, ВидАдреса.Тип);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	CRM_ЗаписатьВсеТипыОтношений(НовыйПартнер);

	// Заполнение КЛ
	Если ЗначениеЗаполнено(ФамилияКонтактногоЛица) ИЛИ ЗначениеЗаполнено(ИмяКонтактногоЛица) ИЛИ ЗначениеЗаполнено(ОтчествоКонтактногоЛица) Тогда
		КонтактноеЛицо = Справочники.КонтактныеЛицаПартнеров.СоздатьЭлемент();

		КонтактноеЛицо.Автор = Пользователи.ТекущийПользователь();

		Если НЕ ЗначениеЗаполнено(КонтактноеЛицо.Автор) Тогда
			КонтактноеЛицо.Автор = Пользователи.АвторизованныйПользователь();
		КонецЕсли;

		КонтактноеЛицо.Наименование	= СокрЛП((?(ЗначениеЗаполнено(ФамилияКонтактногоЛица),   			СокрЛП(ФамилияКонтактногоЛица) + " ", "")
		+ ?(ЗначениеЗаполнено(ИмяКонтактногоЛица), 	 				СокрЛП(ИмяКонтактногоЛица) + " ", "")
		+ ?(ЗначениеЗаполнено(ОтчествоКонтактногоЛица),  			СокрЛП(ОтчествоКонтактногоЛица), "")));   
		КонтактноеЛицо.CRM_Фамилия					= ФамилияКонтактногоЛица;
		КонтактноеЛицо.CRM_Имя						= ИмяКонтактногоЛица;
		КонтактноеЛицо.CRM_Отчество					= ОтчествоКонтактногоЛица;

		КонтактноеЛицо.CRM_Состояние				= Перечисления.CRM_Состояние.Работает;
		КонтактноеЛицо.CRM_Должность				= Должность;
		КонтактноеЛицо.CRM_НапоминатьОДнеРождения	= Истина;
		КонтактноеЛицо.ДатаРегистрацииСвязи = CRM_ОбщегоНазначенияСервер.ПолучитьТекущуюДатуСеанса();

		Если ЗначениеЗаполнено(ВидТелефонаКонтактногоЛица) И ЗначениеЗаполнено(ТелефонКонтактногоЛица) Тогда
			Если НЕ ПустаяСтрока(КодСтраныКонтактногоЛица) И (Найти(КодСтраныКонтактногоЛица, "+") = 0) Тогда
				КодСтраныСтрока = "+" + КодСтраныКонтактногоЛица;
			Иначе
				КодСтраныСтрока = КодСтраныКонтактногоЛица;
			КонецЕсли;				
			СписокПолей 			= Новый СписокЗначений;
			СписокПолей.Добавить(КодСтраныСтрока,     				"КодСтраны");
			СписокПолей.Добавить(КодГородаКонтактногоЛица,     		"КодГорода");
			СписокПолей.Добавить(ТелефонКонтактногоЛица, 			"НомерТелефона");
			СписокПолей.Добавить(ДобНомерКонтактногоЛица,    		"Добавочный");
			СписокПолей.Добавить("",   				"Комментарий");

			CRM_УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(КонтактноеЛицо, CRM_ОбщегоНазначенияСервер.ЗначениеПолейВXML(СписокПолей, ВидТелефонаКонтактногоЛица.Тип)
			, ВидТелефонаКонтактногоЛица, ВидТелефонаКонтактногоЛица.Тип,,, Истина);

		КонецЕсли;

		Если ЗначениеЗаполнено(ВидEmailКонтактногоЛица) И ЗначениеЗаполнено(EmailКонтактногоЛица) Тогда
			НовыйКонтакт						= КонтактноеЛицо.КонтактнаяИнформация.Добавить();
			НовыйКонтакт.Вид					= ВидEmailКонтактногоЛица;
			НовыйКонтакт.Тип					= ВидEmailКонтактногоЛица.Тип;
			НовыйКонтакт.Представление			= СокрЛП(EmailКонтактногоЛица);
			НовыйКонтакт.CRM_ОсновнойДляСвязи	= Истина;

			Попытка
				Результат = ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСПочтовымиАдресами(EmailКонтактногоЛица);
			Исключение
				СообщениеОбОшибке = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
				Возврат Неопределено;
			КонецПопытки;

			Если Результат.Количество() > 0 Тогда
				НовыйКонтакт.АдресЭП = Результат[0].Адрес;

				Поз = Найти(НовыйКонтакт.АдресЭП, "@");
				Если Поз <> 0 Тогда
					НовыйКонтакт.ДоменноеИмяСервера = Сред(НовыйКонтакт.АдресЭП, Поз+1);
				КонецЕсли;
			КонецЕсли;

		КонецЕсли;

		Если ЗначениеЗаполнено(КонтактнаяИнформацияДругоеВид) И ЗначениеЗаполнено(КонтактнаяИнформацияДругое) Тогда

			НовыйКонтакт 						= КонтактноеЛицо.КонтактнаяИнформация.Добавить();
			НовыйКонтакт.Вид					= КонтактнаяИнформацияДругоеВид;
			НовыйКонтакт.Тип					= КонтактнаяИнформацияДругоеВид.Тип;
			НовыйКонтакт.Представление 			= СокрЛП(КонтактнаяИнформацияДругое);

		КонецЕсли;

		Попытка

			НовыйПартнер.Записать();
			КонтактноеЛицо.Владелец = НовыйПартнер.Ссылка;
			КонтактноеЛицо.Записать();
			НовыйПартнер.CRM_ОсновноеКонтактноеЛицо = КонтактноеЛицо.Ссылка;
			НайденныйКонтакт	= КонтактноеЛицо.Ссылка;

			Если ЗначениеЗаполнено(КонтактнаяИнформацияДругоеВид) И ЗначениеЗаполнено(КонтактнаяИнформацияДругое) Тогда

				Если Метаданные.Обработки.Найти("CRM_РаботаСМессенджером"+КонтактнаяИнформацияДругоеВид.Наименование) <> Неопределено Тогда
					CRM_РаботаСМессенджерамиСервер.СвязатьВсеСообщенияПользователяСКонтактом(КонтактнаяИнформацияДругоеВид.Наименование, КонтактнаяИнформацияДругое, НайденныйКонтакт);
				КонецЕсли;

			КонецЕсли;
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		КонецПопытки;

	Иначе

		Если ВидПартнера = Перечисления.КомпанияЧастноеЛицо.ЧастноеЛицо Тогда
			Если ЗначениеЗаполнено(КонтактнаяИнформацияДругоеВид) И ЗначениеЗаполнено(КонтактнаяИнформацияДругое) Тогда

				НовыйКонтакт 						= НовыйПартнер.КонтактнаяИнформация.Добавить();
				Если ТипЗнч(ОснованиеОбращения) = Тип("ДокументСсылка.CRM_СообщениеМессенджера") Тогда
					НовыйКонтакт.Вид = CRM_РаботаСМессенджерамиСерверПовтИсп.ПолучитьВидКИМессенджера(ОснованиеОбращения.УчетнаяЗапись, Справочники.Партнеры.ПустаяСсылка());
				КонецЕсли;
				НовыйКонтакт.Тип					= КонтактнаяИнформацияДругоеВид.Тип;
				НовыйКонтакт.Представление 			= СокрЛП(КонтактнаяИнформацияДругое);

			КонецЕсли;
		КонецЕсли;

	КонецЕсли;

	Попытка
		НовыйПартнер.Записать();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		Возврат Неопределено;		
	КонецПопытки;

	Если СоздаватьКонтрагента Тогда
		ОбъектКонтрагент							= Справочники.Контрагенты.СоздатьЭлемент();
		ОбъектКонтрагент.Партнер					= НовыйПартнер.Ссылка;
		ОбъектКонтрагент.ЮрФизЛицо					= ТипЮрФизЛицаКонтрагента(ЭтоКомпания, ВидКомпании);
		ОбъектКонтрагент.Наименование				= НовыйПартнер.Наименование;
		ОбъектКонтрагент.НаименованиеПолное			= НовыйПартнер.НаименованиеПолное;
		ОбъектКонтрагент.НДСпоСтавкам4и2		= ?(Поставщик И ЭтоКомпания = 0 И ВидКомпании <> 1, НДСпоСтавкам4и2, Ложь);
		ОбъектКонтрагент.ИНН					= ?(ЭтоКомпания = 0,?(ВидКомпании <> 1,ИНН,""),ИННПартнерФизЛицо);
		ОбъектКонтрагент.КПП					= ?(ЭтоКомпания = 0 И (ВидКомпании = 0 Или ВидКомпании = 3),КПП,"");
		ОбъектКонтрагент.КодПоОКПО				= ?(ЭтоКомпания = 0 И ВидКомпании <> 1,КодПоОКПО,"");
		ОбъектКонтрагент.СтранаРегистрации		= ?(ОбъектКонтрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицоНеРезидент, СтранаРегистрации, Справочники.СтраныМира.Россия);
		ОбъектКонтрагент.РегистрационныйНомер	= ?(ОбъектКонтрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицоНеРезидент, РегистрационныйНомер, "");

		Если ЗначениеЗаполнено(ВидАдреса) И ЗначениеЗаполнено(Адрес) Тогда

			Для Каждого Стр Из КонтактнаяИнформацияОписаниеДополнительныхРеквизитов Цикл
				Если Стр.ИмяРеквизита = "Адрес" Тогда
					УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(ОбъектКонтрагент, Стр.Значение, Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента, Перечисления.ТипыКонтактнойИнформации.Адрес);
					УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(ОбъектКонтрагент, Стр.Значение, Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента, Перечисления.ТипыКонтактнойИнформации.Адрес);
				КонецЕсли;
			КонецЦикла;

		КонецЕсли;

		Попытка
			ОбъектКонтрагент.Записать();
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;

	Попытка
		Если ПотенциальныйКлиент <> Справочники.CRM_ПотенциальныеКлиенты.ПустаяСсылка() Тогда
			ПотенциальныйКлиентОбъект = ПотенциальныйКлиент.ПолучитьОбъект();

			ПотенциальныйКлиентОбъект.Партнер = НовыйПартнер.Ссылка;

			ПотенциальныйКлиентОбъект.Записать();

			CRM_ОбщегоНазначенияСервер.ПереписатьАктивныеИнтересыСПотенциальногоКлиентаНаПартнера(ПотенциальныйКлиент, НовыйПартнер.Ссылка, ТекущийИнтерес);
		КонецЕсли;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;

	СегментыСервер.ПроверитьВхождениеПартнераВСегментыПриСоздании(НовыйПартнер.Ссылка);

	Возврат НовыйПартнер.Ссылка;

КонецФункции //++ #1615 смарт: Мосолов 29.01.2024 //Заполнение и передача на сайт менеджеров по расходым материалам

//++ #1615 смарт: Мосолов 29.01.2024 //Заполнение и передача на сайт менеджеров по расходным материалам
&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура смарт_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ВидПартнера = CRM_ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("ОсновнойВидКлиента");
	Если НЕ ЗначениеЗаполнено(ВидПартнера) Тогда
		ВидПартнера = Перечисления.КомпанияЧастноеЛицо.Компания;
	КонецЕсли;

	Если Параметры.Свойство("РежимВыбора") И Параметры.РежимВыбора Тогда
		ДляВыбора = Истина;
	КонецЕсли;

	ОсновнойМенеджер	= Пользователи.ТекущийПользователь();

	ИзменитьПараметрыВыбораВидаТелефона();
	ИзменитьПараметрыВыбораВидаАдреса();
	ИзменитьПараметрыВыбораВидаEmail();

	// +CRM Модуль
	ПравоИзмененияОбъекта               = Истина;
	ИспользуютсяТолькоПартнеры  = ПолучитьФункциональнуюОпцию("ИспользоватьПартнеровКакКонтрагентов");

	СоздаватьКонтрагента = ИспользуютсяТолькоПартнеры;

	Если СоздаватьКонтрагента Тогда

		Элементы.СоздаватьКонтрагента.Видимость = Ложь;

	Иначе

		Элементы.ДекорацияСоздатьКонтрагента.Видимость = Ложь;

	КонецЕсли;
	// -CRM Модуль	
	
	#Вставка   
	
	//++ #1615 смарт: Мосолов 29.01.2024 //Заполнение и передача на сайт менеджеров по расходным материалам
	CRM_СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);  
	//-- #1615 смарт: Мосолов 29.01.2024 
	
	#КонецВставки
	
	Если Параметры.Свойство("ЗначенияЗаполнения") Тогда
		ЗначенияЗаполнения = Параметры.ЗначенияЗаполнения;
		Если ЗначенияЗаполнения.Свойство("Родитель") Тогда
			ГоловноеПредприятие = ЗначенияЗаполнения.Родитель;
		КонецЕсли;
	КонецЕсли;

	Если Параметры.Свойство("Основание") Тогда

		Основание = Параметры.Основание;

		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда

			Email 						= Основание.ОтправительАдрес;	

			ВидEmailКонтактногоЛица		= Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица;
			EmailКонтактногоЛица		= Основание.ОтправительАдрес;

			ОткрытьКарточкуКлиента		= Ложь;
			СоздаемИзВходящегоПисьма 	= Истина;
		КонецЕсли;

	КонецЕсли;

	// +СофтФон
	// Если передан телефон, то добавим его в контактную информацию
	Если Параметры.Свойство("Телефон") Тогда

		Если Найти(Параметры.Телефон, ";") > 0 Тогда
			МассивСтроки = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Параметры.Телефон, ";");
		ИначеЕсли Найти(Параметры.Телефон, ",") > 0 Тогда
			МассивСтроки = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Параметры.Телефон, ",");
		Иначе
			МассивСтроки = Новый Массив();
			МассивСтроки.Добавить(Параметры.Телефон);
		КонецЕсли;	
		СтрокаМассива = МассивСтроки[0];

		СтруктураНомера = сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(СтрокаМассива);
		Если Найти(СтруктураНомера.КодГорода, "9") = 1 Тогда
			ВидТелефонаКлиента	= Справочники.ВидыКонтактнойИнформации.CRM_МобильныйТелефонЧастногоЛица;
			CRM_ФизЛицо			= Истина;
			ВидПартнера			= Перечисления.КомпанияЧастноеЛицо.ЧастноеЛицо;
		Иначе	
			ВидТелефонаКлиента	= Справочники.ВидыКонтактнойИнформации.ТелефонПартнера;
			CRM_ФизЛицо			= Ложь;
			ВидПартнера			= Перечисления.КомпанияЧастноеЛицо.Компания;
		КонецЕсли;
		НеВосстанавливатьВидПартнера = Истина;
		ИзменитьПараметрыВыбораВидаТелефона();
		КодСтраны 	= СтруктураНомера.КодСтраны;
		КодГорода 	= СтруктураНомера.КодГорода;
		Телефон		= СтруктураНомера.НомерТелефона;
		// Иначе, если подключен СофтФон, то берем коды из настроек Софтфона 
	ИначеЕсли сфпСофтФонПроСервер.сфпИспользоватьСофтФон() Тогда
		сфпПараметрыСервера	= сфпСофтФонПроСервер.сфпПараметрыСервера();
		КодСтраны 	= сфпПараметрыСервера.КодСтраны;
		КодГорода 	= сфпПараметрыСервера.КодГорода;
	КонецЕсли;
	Если Параметры.Свойство("Звонок") Тогда
		сфпЗвонок = Параметры.Звонок;
	КонецЕсли;			
	// -СофтФон

	Если Параметры.Свойство("ЗагружатьНастройки") Тогда
		ЗагружатьНастройки = НЕ Параметры.ЗагружатьНастройки;
		Элементы.ЗарегистрироватьКлиентаИВвестиИнтерес.Видимость = ЗагружатьНастройки;
	КонецЕсли;	

	Если Параметры.Свойство("ПараметрыНового") Тогда
		ПотенциальныйКлиент = Параметры.ПараметрыНового.ПотенциальныйКлиент;
		Наименование		= Параметры.ПараметрыНового.Наименование;
		НаименованиеПолное		= Параметры.ПараметрыНового.НаименованиеПолное;
		ВидEmailКлиента		= Справочники.ВидыКонтактнойИнформации.EmailПартнера;
		Email				= Параметры.ПараметрыНового.АдресПочты;
		ИНН = Параметры.ПараметрыНового.ИНН;
		Если Параметры.ПараметрыНового.Свойство("АдресПочтыКонтакта") Тогда
			ВидEmailКонтактногоЛица		= Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица;
			EmailКонтактногоЛица	= Параметры.ПараметрыНового.АдресПочтыКонтакта;
		КонецЕсли;
		Если Параметры.ПараметрыНового.Свойство("ВидПартнера") Тогда
			ВидПартнера = Параметры.ПараметрыНового.ВидПартнера;
		КонецЕсли;
		Если Параметры.ПараметрыНового.Свойство("ПараметрыКЛ") Тогда
			Если ВидПартнера = Перечисления.КомпанияЧастноеЛицо.Компания Тогда
				ФамилияКонтактногоЛица		= Параметры.ПараметрыНового.ПараметрыКЛ.Фамилия;
				ИмяКонтактногоЛица	= Параметры.ПараметрыНового.ПараметрыКЛ.Имя;
				ОтчествоКонтактногоЛица	= Параметры.ПараметрыНового.ПараметрыКЛ.Отчество;
			Иначе
				Фамилия		= Параметры.ПараметрыНового.ПараметрыКЛ.Фамилия;
				Имя	= Параметры.ПараметрыНового.ПараметрыКЛ.Имя;
				Отчество	= Параметры.ПараметрыНового.ПараметрыКЛ.Отчество;
			КонецЕсли;
		КонецЕсли;
		Если Параметры.Свойство("ОснованиеОбращения") Тогда
			Если ТипЗнч(Параметры.ОснованиеОбращения) = Тип("ДокументСсылка.CRM_СообщениеМессенджера") Тогда
				КонтактнаяИнформацияДругоеВид = CRM_РаботаСМессенджерамиСерверПовтИсп.ПолучитьВидКИМессенджера(Параметры.ОснованиеОбращения.УчетнаяЗапись, Справочники.КонтактныеЛицаПартнеров.ПустаяСсылка());
				КонтактнаяИнформацияДругое = CRM_РаботаСМессенджерамиСерверПовтИсп.ПредставлениеКонтактнойИнформацииПользователя(Параметры.ОснованиеОбращения.УчетнаяЗапись,
				Параметры.ОснованиеОбращения.ID_Пользователя);
				Элементы.ГруппаДругаяКонтактнаяИнформация.Видимость = Истина;
			КонецЕсли;
			ОснованиеОбращения = Параметры.ОснованиеОбращения;
		КонецЕсли;
		ВидТелефонаКонтактногоЛица = Справочники.ВидыКонтактнойИнформации.МобильныйТелефонКонтактногоЛица;
		Если ВидПартнера = Перечисления.КомпанияЧастноеЛицо.Компания Тогда
			ВидТелефонаКлиента = Справочники.ВидыКонтактнойИнформации.ТелефонПартнера;
			КодСтраныКонтактногоЛица = КодСтраны;
			КодГородаКонтактногоЛица = КодГорода;
			ТелефонКонтактногоЛица = Телефон;
			ДобНомерКонтактногоЛица = ДобНомер;
			КодСтраны = "";
			КодГорода = "";
			Телефон = "";
			ДобНомер = "";
			Email = "";
		Иначе
			ВидТелефонаКлиента = Справочники.ВидыКонтактнойИнформации.CRM_МобильныйТелефонЧастногоЛица;
			EmailКонтактногоЛица = "";
		КонецЕсли;	
	КонецЕсли;


	Если Параметры.Свойство("ПотенциальныйКлиент") И ЗначениеЗаполнено(Параметры.ПотенциальныйКлиент) Тогда

		ПотенциальныйКлиент	= Параметры.ПотенциальныйКлиент;
		Наименование		= ПотенциальныйКлиент.Наименование;

		// +CRM
		CRM_СсылкаНаИсточникДанных = ПотенциальныйКлиент;
		// -CRM

		ВидТелефонаКонтактногоЛица			= Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица;
		СтрокаТелефонаПотенциальногоКлиента	= ПотенциальныйКлиент.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.CRM_ТелефонПотенциальногоКлиента, "Вид");

		Если НЕ (СтрокаТелефонаПотенциальногоКлиента = Неопределено) Тогда
			Если ЗначениеЗаполнено(СтрокаТелефонаПотенциальногоКлиента.Представление) Тогда
				СтруктураКИ = сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(СтрокаТелефонаПотенциальногоКлиента.Представление);
			Иначе
				СтруктураКИ = CRM_ОбщегоНазначенияСервер.ПреобразоватьСтрокуВСтруктуруПолей(СтрокаТелефонаПотенциальногоКлиента.ЗначенияПолей);
			КонецЕсли;
			КодСтраныКонтактногоЛица 	= СтруктураКИ.КодСтраны;
			КодГородаКонтактногоЛица	= СтруктураКИ.КодГорода;
			ТелефонКонтактногоЛица		= СтруктураКИ.НомерТелефона;
		КонецЕсли;

		ВидEmailКонтактногоЛица	= Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица;
		СтрокаЭлектронногоАдресаПотенциальногоКлиента = ПотенциальныйКлиент.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.CRM_EmailПотенциальногоКлиента, "Вид");

		Если НЕ (СтрокаЭлектронногоАдресаПотенциальногоКлиента = Неопределено) И ЗначениеЗаполнено(СтрокаЭлектронногоАдресаПотенциальногоКлиента.Вид.ИмяПредопределенныхДанных) Тогда
			EmailКонтактногоЛица = СтрокаЭлектронногоАдресаПотенциальногоКлиента.Представление;
		КонецЕсли;

		СтрокаДругойКИПотенциальногоКлиента = ПотенциальныйКлиент.КонтактнаяИнформация.Найти(Перечисления.ТипыКонтактнойИнформации.ВебСтраница, "Тип");

		Если НЕ (СтрокаДругойКИПотенциальногоКлиента = Неопределено) И Метаданные.Обработки.Найти("CRM_РаботаСМессенджером"+СтрокаДругойКИПотенциальногоКлиента.Вид.Наименование) <> Неопределено Тогда
			КонтактнаяИнформацияДругоеВид = Обработки["CRM_РаботаСМессенджером"+СтрокаДругойКИПотенциальногоКлиента.Вид.Наименование].ПолучитьВидКИМессенджера(Справочники.КонтактныеЛицаПартнеров.ПустаяСсылка());
			КонтактнаяИнформацияДругое = СтрокаДругойКИПотенциальногоКлиента.Представление;
			Элементы.ГруппаДругаяКонтактнаяИнформация.Видимость = Истина;
		КонецЕсли;

		Если ЗначениеЗаполнено(ПотенциальныйКлиент.Организация) Тогда
			ВидПартнера = Перечисления.КомпанияЧастноеЛицо.Компания;
			НеВосстанавливатьВидПартнера = Истина;
			Наименование = ПотенциальныйКлиент.Организация;

			ФИОКЛ = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПотенциальныйКлиент.Наименование, " ");

			Если ФИОКЛ.Количество() > 0 Тогда
				ФамилияКонтактногоЛица = ФИОКЛ[0];
			КонецЕсли;
			Если ФИОКЛ.Количество() > 1 Тогда
				ИмяКонтактногоЛица = ФИОКЛ[1];
			КонецЕсли;
			Если ФИОКЛ.Количество() > 2 Тогда
				ОтчествоКонтактногоЛица = ФИОКЛ[2];
			КонецЕсли;
		КонецЕсли;

		Элементы.ОткрытьКарточкуКлиента.Видимость					= Ложь;
		Элементы.ЗарегистрироватьКлиентаИВвестиИнтерес.Видимость	= Ложь;

		ОткрытьКарточкуКлиента = Ложь;

	КонецЕсли;

	Если Параметры.Свойство("ПотенциальныйКлиентСтруктура") Тогда

		ПотенциальныйКлиентСтруктура = Параметры.ПотенциальныйКлиентСтруктура;

		Наименование = ПотенциальныйКлиентСтруктура.Наименование;
		ПравоваяФорма = CRM_ОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(ОсновнойМенеджер, "ПравоваяФормаКлиентаПоУмолчанию");
		НаименованиеПолное = ?(СокрЛП(ПравоваяФорма) = "" ,СокрЛП(Наименование),СокрЛП(ПравоваяФорма)+" """+СокрЛП(Наименование)+"""");

		ФИОКЛ = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Наименование, " ");

		Если ФИОКЛ.Количество() > 0 Тогда
			ФамилияКонтактногоЛица = ФИОКЛ[0];
		КонецЕсли;
		Если ФИОКЛ.Количество() > 1 Тогда
			ИмяКонтактногоЛица = ФИОКЛ[1];
		КонецЕсли;
		Если ФИОКЛ.Количество() > 2 Тогда
			ОтчествоКонтактногоЛица = ФИОКЛ[2];
		КонецЕсли;

		ВидТелефонаКонтактногоЛица = Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица;

		Если НЕ (ПотенциальныйКлиентСтруктура.Телефон = "") Тогда

			ВидКИ = Справочники.ВидыКонтактнойИнформации.CRM_ТелефонПотенциальногоКлиента;

			СтруктураКИ = сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(ПотенциальныйКлиентСтруктура.Телефон);

			КодСтраныКонтактногоЛица = СтруктураКИ.КодСтраны;
			КодГородаКонтактногоЛица = СтруктураКИ.КодГорода;
			ТелефонКонтактногоЛица	 = СтруктураКИ.НомерТелефона;

		КонецЕсли;

		ВидEmailКонтактногоЛица	= Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица;
		EmailКонтактногоЛица = ПотенциальныйКлиентСтруктура.АдресЭП;

		Если ПотенциальныйКлиентСтруктура.Свойство("ОснованиеОбращения") Тогда
			Если ТипЗнч(ПотенциальныйКлиентСтруктура.ОснованиеОбращения) = Тип("ДокументСсылка.CRM_СообщениеМессенджера") Тогда
				КонтактнаяИнформацияДругоеВид = CRM_РаботаСМессенджерамиСерверПовтИсп.ПолучитьВидКИМессенджера(ПотенциальныйКлиентСтруктура.ОснованиеОбращения.УчетнаяЗапись, Справочники.КонтактныеЛицаПартнеров.ПустаяСсылка());
				КонтактнаяИнформацияДругое = ПотенциальныйКлиентСтруктура.ОснованиеОбращения.ID_Пользователя;
				Элементы.ГруппаДругаяКонтактнаяИнформация.Видимость = Истина;
			КонецЕсли;
			ОснованиеОбращения = ПотенциальныйКлиентСтруктура.ОснованиеОбращения;
		КонецЕсли;

		Если ПотенциальныйКлиентСтруктура.Свойство("ИНН") Тогда
			ИНН = ПотенциальныйКлиентСтруктура.ИНН;
		КонецЕсли;

		Элементы.ОткрытьКарточкуКлиента.Видимость					= Ложь;
		Элементы.ЗарегистрироватьКлиентаИВвестиИнтерес.Видимость	= Ложь;

		ОткрытьКарточкуКлиента = Ложь;

	КонецЕсли;

	CRM_ЗаполнитьВсеТипыОтношений();

	Параметры.Свойство("ТекущийИнтерес", ТекущийИнтерес);

	ПредставлениеВыбраноИзСписка = Ложь;

	// СтандартныеПодсистемы.РаботаСКонтрагентами
	ПроверкаКонтрагентов.ИнициализироватьРеквизитыФормыКонтрагент(ЭтотОбъект);
	// +CRM
	РеквизитыПроверкиКонтрагентов.ПроверкаИспользуется = Ложь;
	Элементы.EmailКонтактногоЛица.Доступность = ЗначениеЗаполнено(ВидEmailКонтактногоЛица);
	Элементы.ГруппаТелефонКонтактногоЛица.Доступность = ЗначениеЗаполнено(ВидТелефонаКонтактногоЛица);
	// -CRM

	Если Параметры.Свойство("ЗаголовокФормыВладельца") Тогда

		Если Параметры.ЗаголовокФормыВладельца = НСтр("ru='Партнеры (Клиенты)'") Тогда
			Клиент = Истина;
		ИначеЕсли Параметры.ЗаголовокФормыВладельца = НСтр("ru='Партнеры (Поставщики)'") Тогда
			Поставщик = Истина;
		ИначеЕсли Параметры.ЗаголовокФормыВладельца = НСтр("ru='Партнеры (Конкуренты)'") Тогда
			Конкурент = Истина;
		КонецЕсли;

	КонецЕсли;

	Если ЗначениеЗаполнено(ВидТелефонаКлиента) Тогда
		Если ВидПартнера = Перечисления.КомпанияЧастноеЛицо.ЧастноеЛицо Тогда
			Если ВидТелефонаКлиента.Родитель = Справочники.ВидыКонтактнойИнформации.CRM_СправочникПартнерыКомпания Тогда
				ВидТелефонаКлиента = Справочники.ВидыКонтактнойИнформации.ПустаяСсылка();
			КонецЕсли;	
		Иначе
			Если ВидТелефонаКлиента.Родитель = Справочники.ВидыКонтактнойИнформации.CRM_СправочникПартнерыЧастноеЛицо Тогда
				ВидТелефонаКлиента = Справочники.ВидыКонтактнойИнформации.ПустаяСсылка();
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;	

	// +УТ

	// Группы доступа
	УправлениеДоступом.ПриСозданииФормыЗначенияДоступа(ЭтаФорма, "ГруппаДоступа",, Тип("СправочникСсылка.Партнеры"), Истина);
	ИспользуютсяГруппыДоступаПартнеров = Справочники.ГруппыДоступаПартнеров.ИспользуютсяГруппыДоступа();
	Если Не ИспользуютсяГруппыДоступаПартнеров Тогда
		Элементы.ГруппаДоступа.Видимость = Ложь;
	КонецЕсли;

	// Заполнение Партнера по Контрагенту из типовой УТ
	Если Параметры.Свойство("КонтрагентОснование") И ТипЗнч(Параметры.КонтрагентОснование) = Тип("Структура") Тогда

		ЗаполнитьНаОснованииКонтрагента(Параметры.КонтрагентОснование,Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;

	КонецЕсли;

	НастройкиПодключенияКСервисуИППЗаданы = ПартнерыИКонтрагенты.НастройкиПодключенияКСервисуИППЗаданы();

	УправлениеДоступностьюПервичнаяИнформация();
	// -УТ

КонецПроцедуры 	//-- #1615 смарт: Мосолов 29.01.2024
